openFoamSims/naca0012Aoa10_NoClassML/constant/nutWallModel/layer_metadata.txt
3 64 tanh
64 64 tanh
64 64 tanh
64 64 tanh
64 64 tanh
64 64 tanh
64 1 linear
