openFoamSims/naca0012Aoa10_NoClassML/constant/wallModel_full/wallModel_unified/cz_uncertainty.txt
tau2_channel 6.980734e-03
tau2_couette 2.625367e-02
