openFoamSims/naca0012Aoa10_NoClassML/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

epsInlet         1e-4;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsInlet;

boundaryField
{
    freestream
    {
        type            inletOutlet;
        inletValue      uniform $epsInlet;
        value           uniform $epsInlet;
    }

    wall
    {
        type            epsilonWallFunction;
        value           uniform $epsInlet;
    }

}

// ************************************************************************* //
