openFoamSims/naca0012Aoa10_NoClassML/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    aerofoil
    {
        type            calculated;
        value           nonuniform List<vector> 
560
(
(-2.4443823 2.0360345e-22 -0.5758083)
(-2.4555117 8.4378634e-22 -0.58054615)
(-2.4664488 0 -0.58527359)
(-2.4771896 0 -0.58999534)
(-2.4877379 -1.8748344e-21 -0.59470023)
(-2.4980954 0 -0.59938322)
(-2.5082629 0 -0.60404242)
(-2.5182198 0 -0.60871188)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
