openFoamSims/naca0012Aoa10_NoClassML/system/solverInfo
// -*- C++ -*-

#includeEtc "caseDicts/postProcessing/numerical/solverInfo.cfg"

fields      ( p U e k omega epsilon);


// ************************************************************************* //
